package org.danil.test.college;

import org.danil.test.college.people.Sex;
import org.danil.test.college.people.Student;

import java.util.List;
import java.util.Random;

public class StudentFactory {

    private Random random = new Random();
    private List<String> names = List.of("Александр", "Алексей", "Анастасия", "Андрей", "Анна", "Антон", "Артем", "Борис", "Вадим", "Валентин", "Валерия", "Василий", "Вера", "Вероника", "Виктор", "Виктория", "Виталий", "Владимир", "Владислав", "Галина", "Геннадий", "Георгий", "Григорий", "Даниил", "Дарья", "Денис", "Дмитрий", "Евгений", "Евгения", "Екатерина", "Елена", "Елизавета", "Жанна", "Захар", "Иван", "Игорь", "Илья", "Инна", "Ирина", "Кирилл", "Константин", "Ксения", "Лариса", "Лев", "Леонид", "Лидия", "Любовь", "Людмила", "Майя", "Максим", "Маргарита", "Марина", "Мария", "Матвей", "Михаил", "Надежда", "Наталья", "Никита", "Николай", "Нина", "Оксана", "Олег", "Олеся", "Ольга", "Павел", "Полина", "Раиса", "Роман", "Руслан", "Светлана", "Семен", "Сергей", "София", "Станислав", "Степан", "Таисия", "Тамара", "Татьяна", "Ульяна", "Эдуард", "Эльвира", "Юлия", "Юрий", "Яна", "Ярослав", "Агата", "Адель", "Аида", "Акулина", "Альберт", "Альбина", "Амира", "Ангелина", "Анисья", "Анфиса", "Аркадий", "Арсений", "Архип", "Богдан", "Болеслав", "Бронислав", "Валентина", "Василиса", "Вениамин", "Всеволод", "Гавриил", "Герман", "Глеб", "Гордей", "Демид", "Добрыня", "Евдокия", "Емельян", "Ефим", "Ждан", "Зарина", "Злата", "Зоряна", "Игнатий", "Искра", "Камилла", "Карина", "Каролина", "Клавдия", "Клара", "Клим", "Кристина", "Кузьма", "Лада", "Лана", "Любава", "Марта", "Марфа", "Марьяна", "Мелания", "Милана", "Милена", "Мирослав", "Мирра", "Мстислав", "Наум", "Нелли", "Нестор", "Оскар", "Остап", "Платон", "Прохор", "Радислав", "Радмила", "Рената", "Роберт", "Ростислав", "Рудольф", "Сабина", "Савелий", "Савва", "Святослав", "Снежана", "Созон", "Соломон", "Стефания", "Сюзанна", "Тарас", "Тимофей", "Тихон", "Устинья", "Федор", "Феликс", "Филипп", "Эвелина", "Эмилия", "Эмма", "Юлиан", "Яков", "Ясна");

    public Student[] createGroup(String course) {
        return createGroup(course, random.nextInt(50));
    }

    public Student[] createGroup(String course, Integer countGroup) {
        Student[] students = new Student[countGroup];
        for (int index = 0; index < students.length; index++) {
            students[index] = new Student(
                    random.nextInt(15) + 18,
                    names.get(random.nextInt(names.size())),
                    course,
                    random.nextInt(100),
                    random.nextBoolean() ? Sex.MALE : Sex.FEMALE,
                    random.nextInt(50)
            );
        }
        return students;
    }

}
